GHB2/src/Catalogs/гхб_ФизическиеЛица/гхб_ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ФизЛицаСОшибками</name>
      <description>Физ. лица с ошибками</description>
    </items>
    <items>
      <name>СырыеДанные</name>
      <description>Сырые данные</description>
    </items>
  </predefined>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.гхб_ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияЭлементаОбменом</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияЭлементаОбменом</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/InformationRegisters/гхб_КонтактнаяИнформацияБазХолдинга/гхб_КонтактнаяИнформацияБазХолдинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_КонтактнаяИнформацияБазХолдинга</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>РабочееПомещение</name>
    <type>
      <types>CatalogRef.гхб_РабочиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.гхб_ПользователиБазХолдинга</types>
      <types>CatalogRef.гхб_ФизическиеЛицаБазХолдинга</types>
      <types>CatalogRef.гхб_СотрудникиБазХолдинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ДанныеДляПодбораПриОбмене/гхб_ДанныеДляПодбораПриОбмене.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ДанныеДляПодбораПриОбмене</name>
  <resources>
    <name>ЗначениеСоответствия</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.гхб_ТипыЗначенийДляПодбораПриОбмене</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Enums/гхб_ТипыБазХолдинга/гхб_ТипыБазХолдинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ТипыБазХолдинга</name>
  <enumValues>
    <name>РИБ</name>
  </enumValues>
  <enumValues>
    <name>ManageResources</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Enums/гхб_ТипыЗначенийДляПодбораПриОбмене/гхб_ТипыЗначенийДляПодбораПриОбмене.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ТипыЗначенийДляПодбораПриОбмене</name>
  <enumValues>
    <name>ВидыКонтактнойИнформации</name>
  </enumValues>
  <enumValues>
    <name>ВидыДокументовУдостоверяющихЛичность</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникФизЛица</name>
      <description>Справочник физ. лица</description>
    </items>
    <items>
      <name>РабочееПомещение</name>
      <description>Рабочее помещение</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

GHB2/src/Catalogs/гхб_ФизическиеЛицаБазХолдинга/гхб_ФизическиеЛицаБазХолдинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_ФизическиеЛицаБазХолдинга</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>GUIDБазыХолдинга</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицоТекущейБазы</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоменноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияЭлементаОбменом</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияЭлементаОбменом</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.гхб_ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчетДляВыплат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СКР_ДляВыплатНаБанк</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОРусское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОАнглийское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НетСоответствияВУчетныхБазах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/Catalogs/гхб_ФизическиеЛица/Forms/ФормаКопированияСвойств/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ЗаполнитьДанныеПоПользователямИКонтакнойИнформации(Параметры);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьСписокВыбораДляНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбновитьДинамическиеСпискиВладельцаФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДанныеДляКопированияЗначениеПриИзменении(Элемент)	
	УстнановитьПризнакИзменения();	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляКопированияЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.ДанныеДляКопирования.ТекущиеДанные;
	Если ТекСтрока <> Неопределено 
			И ТекСтрока.Настройка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.РабочееПомещение") Тогда
		ОткрытьФорму("Справочник.гхб_РабочиеПомещения.Форма.ФормаВыбора", , Элементы.ДанныеДляКопированияЗначение);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляКопированияНастройкаПриИзменении(Элемент)
	
	УстнановитьПризнакИзменения();
	УстановитьСписокВыбораДляНастроек();
	УстановитьМаскуИВозможностьРеадктированияДляТекущейСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляКопированияПередУдалением(Элемент, Отказ)
	
	ТекСтрока = Элементы.ДанныеДляКопирования.ТекущиеДанные;
	Если ТекСтрока <> Неопределено И ТекСтрока.СтрокаЗагружена Тогда
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляКопированияПослеУдаления(Элемент)
	УстановитьСписокВыбораДляНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляКопированияПриАктивизацииСтроки(Элемент)	
	УстановитьМаскуИВозможностьРеадктированияДляТекущейСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляКопированияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура СкопироватьСвойства(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаКомандыСкопироватьСвойства", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Вы действительно хотите скопировать свойства объекта?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,
						"Копирование свойств объекта");

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометку(Команда)
	УстановитьСнятьПометкуОбмена(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометку(Команда)
	УстановитьСнятьПометкуОбмена(Ложь);
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоПользователямИКонтакнойИнформации(Параметры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА гхб_ФизическиеЛицаБазХолдинга.Ссылка = &ФизЛицоСКогоКопировать
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Откуда,
		|	ВЫБОР
		|		КОГДА гхб_ФизическиеЛицаБазХолдинга.Ссылка = &ФизЛицоСКогоКопировать
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Куда,
		|	гхб_ФизическиеЛицаБазХолдинга.Ссылка КАК ФизЛицо,
		|	гхб_ФизическиеЛицаБазХолдинга.GUIDБазыХолдинга КАК GUIDБазыХолдинга,
		|	гхб_ФизическиеЛицаБазХолдинга.БазаХолдинга КАК БазаХолдинга,
		|	гхб_ФизическиеЛицаБазХолдинга.БазаХолдинга.ВнешнийИсточникПоУмолчанию КАК ВнешнийИсточник
		|ИЗ
		|	Справочник.гхб_ФизическиеЛицаБазХолдинга КАК гхб_ФизическиеЛицаБазХолдинга
		|ГДЕ
		|	гхб_ФизическиеЛицаБазХолдинга.ФизЛицоТекущейБазы = &ФизЛицоТекущейБазы
		|	И гхб_ФизическиеЛицаБазХолдинга.БазаХолдинга.ТипБазы = ЗНАЧЕНИЕ(Перечисление.гхб_ТипыБазХолдинга.РИБ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА &НастройкаКопирования = ""Доменное имя""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Копировать,
		|	""Доменное имя"" КАК Настройка,
		|	гхб_ФизическиеЛицаБазХолдинга.ДоменноеИмя КАК Значение,
		|	ИСТИНА КАК СтрокаЗагружена
		|ИЗ
		|	Справочник.гхб_ФизическиеЛицаБазХолдинга КАК гхб_ФизическиеЛицаБазХолдинга
		|ГДЕ
		|	гхб_ФизическиеЛицаБазХолдинга.Ссылка = &ФизЛицоСКогоКопировать
		|	И гхб_ФизическиеЛицаБазХолдинга.БазаХолдинга.ТипБазы = ЗНАЧЕНИЕ(Перечисление.гхб_ТипыБазХолдинга.РИБ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &НастройкаКопирования = гхб_КонтактнаяИнформацияБазХолдинга.Вид
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	гхб_КонтактнаяИнформацияБазХолдинга.Вид,
		|	гхб_КонтактнаяИнформацияБазХолдинга.Представление,
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.гхб_КонтактнаяИнформацияБазХолдинга КАК гхб_КонтактнаяИнформацияБазХолдинга
		|ГДЕ
		|	гхб_КонтактнаяИнформацияБазХолдинга.Объект = &ФизЛицоСКогоКопировать
		|	И гхб_КонтактнаяИнформацияБазХолдинга.БазаХолдинга.ТипБазы = ЗНАЧЕНИЕ(Перечисление.гхб_ТипыБазХолдинга.РИБ)
		|	И гхб_КонтактнаяИнформацияБазХолдинга.Вид В(&МассивНастроекДляКопирования)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	гхб_ДанныеДляПодбораПриОбмене.БазаХолдинга КАК БазаХолдинга,
		|	гхб_ДанныеДляПодбораПриОбмене.УИД КАК УИД,
		|	гхб_ДанныеДляПодбораПриОбмене.ЗначениеСоответствия КАК ЗначениеСоответствия
		|ИЗ
		|	РегистрСведений.гхб_ДанныеДляПодбораПриОбмене КАК гхб_ДанныеДляПодбораПриОбмене
		|ГДЕ
		|	гхб_ДанныеДляПодбораПриОбмене.Тип = ЗНАЧЕНИЕ(Перечисление.гхб_ТипыЗначенийДляПодбораПриОбмене.ВидыКонтактнойИнформации)
		|	И гхб_ДанныеДляПодбораПриОбмене.ЗначениеСоответствия В(&МассивНастроекДляКопирования)
		|
		|СГРУППИРОВАТЬ ПО
		|	гхб_ДанныеДляПодбораПриОбмене.БазаХолдинга,
		|	гхб_ДанныеДляПодбораПриОбмене.УИД,
		|	гхб_ДанныеДляПодбораПриОбмене.ЗначениеСоответствия";
	
	Запрос.УстановитьПараметр("ФизЛицоТекущейБазы", Параметры.ФизЛицоТекущейБазы);
	Запрос.УстановитьПараметр("ФизЛицоСКогоКопировать", Параметры.ФизЛицоСКогоКопировать);
	Запрос.УстановитьПараметр("НастройкаКопирования", Параметры.НастройкаКопирования);
	
	МассивНастроекДляКопирования = Новый Массив;
	МассивНастроекДляКопирования.Добавить(Справочники.ВидыКонтактнойИнформации.МобильныйТелефонСотрудника);
	МассивНастроекДляКопирования.Добавить(Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);
	МассивНастроекДляКопирования.Добавить(Справочники.ВидыКонтактнойИнформации.СлужебныйТелефонПользователя);
	МассивНастроекДляКопирования.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица);
	МассивНастроекДляКопирования.Добавить(Справочники.ВидыКонтактнойИнформации.РабочееПомещение);
	
	Запрос.УстановитьПараметр("МассивНастроекДляКопирования", МассивНастроекДляКопирования);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	СписокФизЛиц.Загрузить(ПакетЗапросов[0].Выгрузить());
	ДанныеДляКопирования.Загрузить(ПакетЗапросов[1].Выгрузить());
	УИДыКонтакнойИнформацииБазХолдинга.Загрузить(ПакетЗапросов[2].Выгрузить());

КонецПроцедуры

&НаСервере
Процедура СкопироватьСвойстваНаСервере()
			
	НайдСтрокиКуда = СписокФизЛиц.НайтиСтроки(Новый Структура("Куда", Истина));
	Для каждого СтрКуда Из НайдСтрокиКуда Цикл
		
		НайдСтрокиНастроек = ДанныеДляКопирования.НайтиСтроки(Новый Структура("Копировать", Истина));
		Для каждого СтрНастройка Из НайдСтрокиНастроек Цикл
			
			Если ЗначениеЗаполнено(СтрНастройка.Настройка) Тогда			
				Если СтрНастройка.Настройка = "Доменное имя" Тогда			
					УстановкаДоменногоИмени(СтрКуда, СтрНастройка);
				Иначе
					УстановкаКонтактнойИнформации(СтрКуда, СтрНастройка);
				КонецЕсли;				
			КонецЕсли;
		
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановкаДоменногоИмени(СтрКуда, СтрНастройка)
	
	//++ a.romanchuk 06.11.2020 #
	_Ответ = гхб_ВзаимодействияСервер.УстановитьДоменноеИмяФизлицаВБазеХолдинга(СтрКуда.БазаХолдинга, СтрКуда.ФизЛицо, СтрНастройка.Значение);
	
	ОбщегоНазначения.СообщитьПользователю(_Ответ.ТекстСообщения);
	
	Если _Ответ.Успешно Тогда
		
		СтрНастройка.СтрокаИзменена = Ложь;
		СтрНастройка.СтрокаЗагружена = Истина;
		
	КонецЕсли;
	
	//СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("УИДФизическогоЛица", СтрКуда.GUIDБазыХолдинга);
	//СтруктураПараметров.Вставить("ДоменноеИмя", СтрНастройка.Значение);
	//
	//ОтветСервиса = JsonRPC.ВыполнитьПроцедуруJsonRPC(СтрКуда.ВнешнийИсточник, 
	//													"УстановитьЗначениеДоменногоИмени", 
	//													СтруктураПараметров);
	//													
	//ТекстНеудачногоОбмена = "Не удалось установить доменное имя. ";
	//Если НЕ ОтветСервиса.ОбменПрошел Тогда
	//	ОбщегоНазначения.СообщитьПользователю(ТекстНеудачногоОбмена + ОтветСервиса.ТекстОшибки + ". База - " + СтрКуда.БазаХолдинга);
	//ИначеЕсли НЕ ОтветСервиса.Результат.result.Данные[0].ЗначениеУстановлено Тогда
	//	ОбщегоНазначения.СообщитьПользователю(ТекстНеудачногоОбмена + "База - " + СтрКуда.БазаХолдинга);
	//Иначе					
	//	
	//	Попытка
	//		
	//		УстановитьПривилегированныйРежим(Истина);
	//		
	//		ОбъектФизЛицо = СтрКуда.ФизЛицо.ПолучитьОбъект();
	//		ОбъектФизЛицо.ДоменноеИмя = СтрНастройка.Значение;
	//		ОбъектФизЛицо.Записать();
	//		
	//		УстановитьПривилегированныйРежим(Ложь);
	//		
	//		ОбщегоНазначения.СообщитьПользователю("Доменное имя установлено. База - " + СтрКуда.БазаХолдинга);
	//		
	//		СтрНастройка.СтрокаИзменена = Ложь;
	//		СтрНастройка.СтрокаЗагружена = Истина;
	//	
	//	Исключение
	//		ОбщегоНазначения.СообщитьПользователю(ТекстНеудачногоОбмена + ОписаниеОшибки() + ". База - " + СтрКуда.БазаХолдинга);
	//	КонецПопытки;
	//	
	//КонецЕсли;
	//-- a.romanchuk 06.11.2020 #

КонецПроцедуры

&НаСервере
Процедура УстановкаКонтактнойИнформации(СтрКуда, СтрНастройка)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("УИДОбъекта", СтрКуда.GUIDБазыХолдинга);
	СтруктураПараметров.Вставить("ТипСправочника", "ФизическиеЛица");
	СтруктураПараметров.Вставить("ЗначениеКонтакнойИнформации", СтрНастройка.Значение);
	
	СтруктураПоискаУИДа = Новый Структура;
	СтруктураПоискаУИДа.Вставить("БазаХолдинга", СтрКуда.БазаХолдинга);
	СтруктураПоискаУИДа.Вставить("ЗначениеСоответствия", СтрНастройка.Настройка);
	
	НайдСтрокиУИДКонтакнойИнформации = УИДыКонтакнойИнформацииБазХолдинга.НайтиСтроки(СтруктураПоискаУИДа);
	Если НайдСтрокиУИДКонтакнойИнформации.Количество() > 0 Тогда
	
		СтрокаПоиска = НайдСтрокиУИДКонтакнойИнформации[0];
		СтруктураПараметров.Вставить("ВидКонтакнойИнформацииУИД", СтрокаПоиска.УИД);
	
	КонецЕсли;
	
	ОтветСервиса = JsonRPC.ВыполнитьПроцедуруJsonRPC(СтрКуда.ВнешнийИсточник, 
														"УстановитьЗначениеКонтактнойИнформации", 
														СтруктураПараметров);
														
	ТекстНеудачногоОбмена = "Не удалось установить контактную информацию (" + СтрНастройка.Настройка + "). ";
	Если НЕ ОтветСервиса.ОбменПрошел Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстНеудачногоОбмена + ОтветСервиса.ТекстОшибки + ". База - " + СтрКуда.БазаХолдинга);
	ИначеЕсли НЕ ОтветСервиса.Результат.result.Данные[0].ЗначениеУстановлено Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстНеудачногоОбмена + "База - " + СтрКуда.БазаХолдинга);
	Иначе					
		
		Попытка
			
			УстановитьПривилегированныйРежим(Истина);
			
			МенеджерЗаписи = РегистрыСведений.гхб_КонтактнаяИнформацияБазХолдинга.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Объект = СтрКуда.ФизЛицо;
			МенеджерЗаписи.Тип = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрНастройка.Настройка, "Тип");
			МенеджерЗаписи.Вид = СтрНастройка.Настройка;
			МенеджерЗаписи.БазаХолдинга = СтрКуда.БазаХолдинга;
			МенеджерЗаписи.Представление = СтрНастройка.Значение;
			МенеджерЗаписи.Записать();
			
			УстановитьПривилегированныйРежим(Ложь);
			
			ОбщегоНазначения.СообщитьПользователю("Контактная информация (" + СтрНастройка.Настройка + ") установлена. База - " + СтрКуда.БазаХолдинга);
			
			СтрНастройка.СтрокаИзменена = Ложь;
			СтрНастройка.СтрокаЗагружена = Истина;
		
		Исключение
			ОбщегоНазначения.СообщитьПользователю(ТекстНеудачногоОбмена + ОписаниеОшибки() + ". База - " + СтрКуда.БазаХолдинга);
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьПометкуОбмена(ТипУстановки)
	
	Для каждого СтрФизЛицо Из СписокФизЛиц Цикл
		СтрФизЛицо.Куда = ТипУстановки;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыСкопироватьСвойства(Результат, ДополнительныеСвойства) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда		
		СкопироватьСвойстваНаСервере();		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДинамическиеСпискиВладельцаФормы()
	
	Если ВладелецФормы <> Неопределено И ВладелецФормы.ИмяФормы = "Справочник.гхб_ФизическиеЛица.Форма.ФормаЭлемента" Тогда
	
		ВладелецФормы.Элементы.ФизЛицаБазХолдинга.Обновить();
		ВладелецФормы.Элементы.КонтактнаяИнформация.Обновить();	
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстнановитьПризнакИзменения()
	
	ТекСтрока = Элементы.ДанныеДляКопирования.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		
		ТекСтрока.Копировать = Истина;
		ТекСтрока.СтрокаИзменена = Истина;
		
		НайдСтрокиОткудаКопируют = СписокФизЛиц.НайтиСтроки(Новый Структура("Откуда", Истина));
		Если НайдСтрокиОткудаКопируют.Количество() > 0 Тогда
			НайдСтрокиОткудаКопируют[0].Куда = Истина;
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСписокВыбораДляНастроек()
	
	МассивНастроекДляКопирования = Новый Массив;
	МассивНастроекДляКопирования.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.МобильныйТелефонСотрудника"));
	МассивНастроекДляКопирования.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя"));
	МассивНастроекДляКопирования.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СлужебныйТелефонПользователя"));
	МассивНастроекДляКопирования.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонФизЛица"));
	МассивНастроекДляКопирования.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.РабочееПомещение"));
	
	СписокВыбора = Элементы.ДанныеДляКопированияНастройка.СписокВыбора;
	СписокВыбора.Очистить();
	Для каждого ЭлементНастройка Из МассивНастроекДляКопирования Цикл
	
		НайдСтрокиКонтактнаяИформация = ДанныеДляКопирования.НайтиСтроки(Новый Структура("Настройка", ЭлементНастройка));
		Если НайдСтрокиКонтактнаяИформация.Количество() = 0 Тогда
			СписокВыбора.Добавить(ЭлементНастройка);	
		КонецЕсли; 
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьМаскуИВозможностьРеадктированияДляТекущейСтроки()
	
	ТекСтрока = Элементы.ДанныеДляКопирования.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда
		
		МассивМобильныхТелефонов = Новый Массив;
		МассивМобильныхТелефонов.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.МобильныйТелефонСотрудника"));
		МассивМобильныхТелефонов.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонФизЛица"));
		
		Если МассивМобильныхТелефонов.Найти(ТекСтрока.Настройка) <> Неопределено Тогда
			Элементы.ДанныеДляКопированияЗначение.Маска = "+380999999999";
		ИначеЕсли ТекСтрока.Настройка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.СлужебныйТелефонПользователя") Тогда
			Элементы.ДанныеДляКопированияЗначение.Маска = "99999";
		Иначе	
			Элементы.ДанныеДляКопированияЗначение.Маска = "";
		КонецЕсли;
		
		Если ТекСтрока.Настройка = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.РабочееПомещение") Тогда
			Элементы.ДанныеДляКопированияЗначение.РедактированиеТекста = Ложь;
		Иначе
			Элементы.ДанныеДляКопированияЗначение.РедактированиеТекста = Истина;
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
